Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/atdf/PIC32CZ8110CA80176.atdf
        <module name="MLB" id="03809" name2="mlb_3pin_sib_v1" version="1a0">
          <instance name="MLB">
            <register-group name="MLB" name-in-module="MLB" address-space="base" offset="0x458C0000"/>
            <signals>
              <signal group="MLBC" function="G" pad="PD07"/>
              <signal group="MLBD" function="G" pad="PD09"/>
              <signal group="MLBS" function="G" pad="PD08"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="62" caption="Index of Generic Clock"/>
              <param name="MLB_MEM_MARGINADJ_MSB" value="4" caption="MBIST input margin adjustment control"/>
              <param name="INSTANCE_ID" value="66" caption="Instance index for MLB"/>
              <param name="MCLK_ID_AHB" value="78" caption="Index for MLB AHB clock"/>
              <param name="MCLK_ID_APB" value="79" caption="Index for MLB APB clock"/>
              <param name="PAC_ID" value="66" caption="Index for MLB registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="MPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
            <parameters>
              <param name="__MPU_REGIONS" value="8" caption="Number of MPU regions"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" id="SYSTEM_IP" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E000"/>
            <parameters>
              <param name="NUM_IRQ" value="222" caption="Number of interrupt requests"/>
              <param name="__NVIC_PRIO_BITS" value="3" caption="Number of NVIC interrupt priority bits"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="03717" name2="osc_osc32kctrl_u2400_v2" version="2a0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x44042000"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PB05"/>
              <signal group="XOUT32" function="XOUT32" pad="PB04"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="7" caption="Instance index for OSC32KCTRL"/>
              <param name="MCLK_ID_APB" value="10" caption="Index for OSC32KCTRL APB clock"/>
              <param name="PAC_ID" value="7" caption="Index for OSC32KCTRL registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="OSCCTRL" id="03718" name2="osc_oscctrl_u2401_v2" version="2a0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x44040000"/>
            <signals>
              <signal group="XIN" function="XIN0" pad="PD01"/>
              <signal group="XOUT" function="XOUT0" pad="PD00"/>
            </signals>
            <parameters>
              <param name="DFLL48M_ATEST_IMPLEMENTED" value="1" caption="DFLL48M ATEST register implemented"/>
              <param name="DFLL48M_ATEST_SIZE" value="8" caption="number of effective bits in DFLL48M ATEST register"/>
              <param name="DFLL48M_IS_STARTUP_OSCILLATOR" value="1" caption="DFLL48M is startup oscillator"/>
              <param name="DFLL48M_RC48MCAL0_PORVAL" value="0x0" caption="Defines the RC48MCAL0 register reset value after POR."/>
              <param name="DIV_8MHZ_NUM" value="8"/>
              <param name="FRACDIVS_NUM" value="2" caption="Number of FRACDIVs"/>
              <param name="FRACDIV_DIVIDER_RESET_VAL" value="32" caption="Fracdiv Divider reset value"/>
              <param name="FRACDIV_PLLSRC" value="1" caption="Indice of the PLL that is source of the FRACDIV"/>
              <param name="GCLK_ID_DFLL48M" value="0" caption="Index of Generic Clock for DFLL48"/>
              <param name="GCLK_ID_PLL_0" value="1" caption="Index of Generic Clock for PLL 0"/>
              <param name="GCLK_ID_PLL_1" value="2" caption="Index of Generic Clock for PLL 1"/>
              <param name="PLLS_NUM" value="2" caption="Number of PLLs"/>
              <param name="PLL0_OUTPUTS_NUM" value="4" caption="number of clock outputs for PLL0"/>
              <param name="PLL1_OUTPUTS_NUM" value="4" caption="number of clock outputs for PLL1"/>
              <param name="USBHS_NUM" value="2" caption="Number of usbhs clock requests"/>
              <param name="XOSC_ATEST_IMPLEMENTED" value="1" caption="XOSC ATEST register implemented"/>
              <param name="XOSC_ATEST_SIZE" value="4" caption="number of effective bits in XOSC ATEST register"/>
              <param name="XOSC_CFD_CLK_SELECT_SIZE" value="4" caption="Clock fail prescaler size"/>
              <param name="XOSC_CFD_HAS_RETENTION" value="0" caption="Clock fail detected for xosc is in tetention domain"/>
              <param name="INSTANCE_ID" value="6" caption="Instance index for OSCCTRL"/>
              <param name="MCLK_ID_APB" value="9" caption="Index for OSCCTRL APB clock"/>
              <param name="PAC_ID" value="6" caption="Index for OSCCTRL registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="03585" name2="sec_pac_u2120_v2" version="2b0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x44810000"/>
            <parameters>
              <param name="HMATRIX1_IMPLEMENTED" value="0"/>
              <param name="HPB_NUM" value="3" caption="Number of bridges AHB/APB"/>
              <param name="SECURE_IMPLEMENTED" value="0" caption="Security Configuration implemented?"/>
              <param name="INSTANCE_ID" value="14" caption="Instance index for PAC"/>
              <param name="MCLK_ID_AHB" value="17" caption="Index for PAC AHB clock"/>
              <param name="MCLK_ID_APB" value="18" caption="Index for PAC APB clock"/>
              <param name="PAC_ID" value="14" caption="Index for PAC registers write protection"/>
            </parameters>
          </instance>
        </module>
