Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/atdf/PIC32CZ8110CA80176.atdf
      <value-group name="ACESR__ACMD12NE">
        <value name="EXEC" caption="Executed" value="0"/>
        <value name="NOT_EXEC" caption="Not executed" value="1"/>
      </value-group>
      <value-group name="ACESR__ACMDTEO">
        <value name="NO" caption="No error" value="0"/>
        <value name="YES" caption="Timeout" value="1"/>
      </value-group>
      <value-group name="ACESR__ACMDCRC">
        <value name="NO" caption="No error" value="0"/>
        <value name="YES" caption="CRC Error Generated" value="1"/>
      </value-group>
      <value-group name="ACESR__ACMDEND">
        <value name="NO" caption="No error" value="0"/>
        <value name="YES" caption="End Bit Error Generated" value="1"/>
      </value-group>
      <value-group name="ACESR__ACMDIDX">
        <value name="NO" caption="No error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="ACESR__CMDNI">
        <value name="OK" caption="No error" value="0"/>
        <value name="NOT_ISSUED" caption="Not Issued" value="1"/>
      </value-group>
      <value-group name="HC2R__UHSMS">
        <value name="SDR12" caption="SDR12" value="0"/>
        <value name="SDR25" caption="SDR25" value="1"/>
        <value name="SDR50" caption="SDR50" value="2"/>
        <value name="SDR104" caption="SDR104" value="3"/>
        <value name="DDR50" caption="DDR50" value="4"/>
      </value-group>
      <value-group name="HC2R__VS18EN">
        <value name="S33V" caption="3.3V Signaling" value="0"/>
        <value name="S18V" caption="1.8V Signaling" value="1"/>
      </value-group>
      <value-group name="HC2R__HS200EN">
        <value name="SDR12" caption="SDR12" value="0"/>
        <value name="SDR25" caption="SDR25" value="1"/>
        <value name="SDR50" caption="SDR50" value="2"/>
        <value name="SDR104" caption="SDR104" value="3"/>
        <value name="DDR50" caption="DDR50" value="4"/>
      </value-group>
      <value-group name="HC2R__DRVSEL">
        <value name="B" caption="Driver Type B is Selected (Default)" value="0"/>
        <value name="A" caption="Driver Type A is Selected" value="1"/>
        <value name="C" caption="Driver Type C is Selected" value="2"/>
        <value name="D" caption="Driver Type D is Selected" value="3"/>
      </value-group>
      <value-group name="HC2R__EXTUN">
        <value name="NO" caption="Not Tuned or Tuning Completed" value="0"/>
        <value name="REQUESTED" caption="Execute Tuning" value="1"/>
      </value-group>
      <value-group name="HC2R__SLCKSEL">
        <value name="FIXED" caption="Fixed clock is used to sample data" value="0"/>
        <value name="TUNED" caption="Tuned clock is used to sample data" value="1"/>
      </value-group>
      <value-group name="HC2R__ASINTEN">
        <value name="DISABLED" caption="Disabled" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="HC2R__PVALEN">
        <value name="HOST" caption="SDCLK and Driver Strength are controlled by Host Controller" value="0"/>
        <value name="AUTO" caption="Automatic Selection by Preset Value is Enabled" value="1"/>
      </value-group>
      <value-group name="CA0R__TEOCLKF">
        <value name="OTHER" caption="Get information via another method" value="0"/>
      </value-group>
      <value-group name="CA0R__TEOCLKU">
        <value name="KHZ" caption="KHz" value="0"/>
        <value name="MHZ" caption="MHz" value="1"/>
      </value-group>
      <value-group name="CA0R__BASECLKF">
        <value name="OTHER" caption="Get information via another method" value="0"/>
      </value-group>
      <value-group name="CA0R__MAXBLKL">
        <value name="512" caption="512 bytes" value="0"/>
        <value name="1024" caption="1024 bytes" value="1"/>
        <value name="2048" caption="2048 bytes" value="2"/>
      </value-group>
      <value-group name="CA0R__ED8SUP">
        <value name="NO" caption="8-bit Bus Width not Supported" value="0"/>
        <value name="YES" caption="8-bit Bus Width Supported" value="1"/>
      </value-group>
      <value-group name="CA0R__ADMA2SUP">
        <value name="NO" caption="ADMA2 not Supported" value="0"/>
        <value name="YES" caption="ADMA2 Supported" value="1"/>
      </value-group>
      <value-group name="CA0R__HSSUP">
        <value name="NO" caption="High Speed not Supported" value="0"/>
        <value name="YES" caption="High Speed Supported" value="1"/>
      </value-group>
      <value-group name="CA0R__SDMASUP">
        <value name="NO" caption="SDMA not Supported" value="0"/>
        <value name="YES" caption="SDMA Supported" value="1"/>
      </value-group>
      <value-group name="CA0R__SRSUP">
        <value name="NO" caption="Suspend/Resume not Supported" value="0"/>
        <value name="YES" caption="Suspend/Resume Supported" value="1"/>
      </value-group>
      <value-group name="CA0R__V33VSUP">
        <value name="NO" caption="3.3V Not Supported" value="0"/>
        <value name="YES" caption="3.3V Supported" value="1"/>
      </value-group>
      <value-group name="CA0R__V30VSUP">
        <value name="NO" caption="3.0V Not Supported" value="0"/>
        <value name="YES" caption="3.0V Supported" value="1"/>
      </value-group>
      <value-group name="CA0R__V18VSUP">
        <value name="NO" caption="1.8V Not Supported" value="0"/>
        <value name="YES" caption="1.8V Supported" value="1"/>
      </value-group>
      <value-group name="CA0R__SB64SUP">
        <value name="NO" caption="32-bit Address Descriptors and System Bus" value="0"/>
        <value name="YES" caption="64-bit Address Descriptors and System Bus" value="1"/>
      </value-group>
      <value-group name="CA0R__ASINTSUP">
        <value name="NO" caption="Asynchronous Interrupt not Supported" value="0"/>
        <value name="YES" caption="Asynchronous Interrupt supported" value="1"/>
      </value-group>
      <value-group name="CA0R__SLTYPE">
        <value name="REMOVABLE" caption="Removable Card Slot" value="0"/>
        <value name="EMBEDDED" caption="Embedded Slot for One Device" value="1"/>
      </value-group>
      <value-group name="CA1R__SDR50SUP">
        <value name="NO" caption="SDR50 is Not Supported" value="0"/>
        <value name="YES" caption="SDR50 is Supported" value="1"/>
      </value-group>
      <value-group name="CA1R__SDR104SUP">
        <value name="NO" caption="SDR104 is Not Supported" value="0"/>
        <value name="YES" caption="SDR104 is Supported" value="1"/>
      </value-group>
      <value-group name="CA1R__DDR50SUP">
        <value name="NO" caption="DDR50 is Not Supported" value="0"/>
        <value name="YES" caption="DDR50 is Supported" value="1"/>
      </value-group>
      <value-group name="CA1R__DRVASUP">
        <value name="NO" caption="Driver Type A is Not Supported" value="0"/>
        <value name="YES" caption="Driver Type A is Supported" value="1"/>
      </value-group>
      <value-group name="CA1R__DRVCSUP">
        <value name="NO" caption="Driver Type C is Not Supported" value="0"/>
        <value name="YES" caption="Driver Type C is Supported" value="1"/>
      </value-group>
      <value-group name="CA1R__DRVDSUP">
        <value name="NO" caption="Driver Type D is Not Supported" value="0"/>
        <value name="YES" caption="Driver Type D is Supported" value="1"/>
      </value-group>
      <value-group name="CA1R__TCNTRT">
        <value name="DISABLED" caption="Re-Tuning Timer disabled" value="0"/>
        <value name="1S" caption="1 second" value="1"/>
        <value name="2S" caption="2 seconds" value="2"/>
        <value name="4S" caption="4 seconds" value="3"/>
        <value name="8S" caption="8 seconds" value="4"/>
        <value name="16S" caption="16 seconds" value="5"/>
        <value name="32S" caption="32 seconds" value="6"/>
        <value name="64S" caption="64 seconds" value="7"/>
        <value name="128S" caption="128 seconds" value="8"/>
        <value name="256S" caption="256 seconds" value="9"/>
        <value name="512S" caption="512 seconds" value="10"/>
        <value name="1024S" caption="1024 seconds" value="11"/>
        <value name="OTHER" caption="Get information from other source" value="15"/>
      </value-group>
      <value-group name="CA1R__TSDR50">
        <value name="NO" caption="SDR50 does not require tuning" value="0"/>
        <value name="YES" caption="SDR50 requires tuning" value="1"/>
      </value-group>
      <value-group name="CA1R__CLKMULT">
        <value name="NO" caption="Clock Multiplier is Not Supported" value="0"/>
      </value-group>
